{
  "trending": [
    {
      "title": "'Judged on one night' - the cost of defeat in boxing",
      "date": "2025-06-19",
      "slug": "'judged-on-one-night'-the-cost-of-defeat-in-boxing",
      "source": "BBC Sport",
      "original_link": "https://www.bbc.com/sport/boxing/articles/cwynzprpe9yo",
      "content": "- Bradley Rea, a boxer, suffered his first professional loss in 2022, which led to him being sidelined from mainstream boxing for two and a half years.\n- Despite the setback, Rea is set to headline a fight for the vacant European light-heavyweight title on 28 June, marking his return to the spotlight.\n- Rea believes that his story exemplifies why some fighters are hesitant to face riskier opponents in boxing, as the sport is primarily a business where profit is key.\n- Rea's recent bouts have been plagued with cancellations and last-minute changes, but he remains optimistic about his career and aims to win the European title to prove his worth and make a comeback in big fights.",
      "image": "",
      "category": "general"
    },
    {
      "title": "",
      "date": "2025-06-19",
      "slug": "2025-college-world-series:-schedule-results-bracket-as-coastal-carolina-lsu-will-battle-for-national-title",
      "source": "",
      "original_link": "",
      "content": "- Coastal Carolina and LSU have advanced to the final of the 2025 College World Series in Omaha, Nebraska.\n- Coastal Carolina, winners of 26 straight, are aiming for their second NCAA title, while LSU is looking to win their eighth national title.\n- LSU secured their spot in the final by scoring three runs in the bottom of the ninth against Arkansas, who missed defensive opportunities that could have forced a winner-take-all showdown.\n- Arkansas pitcher Gage Wood threw a historic no-hitter in the College World Series, but the team was eliminated by LSU.\n- The championship series between Coastal Carolina and LSU will consist of three games, with LSU being the betting favorite to win the national title.",
      "image": "",
      "category": "general"
    },
    {
      "title": "",
      "date": "2025-06-19",
      "slug": "2025-fifa-club-world-cup-standings-table:-lionel-messi-and-inter-miami-vs.-porto-live-stream",
      "source": "",
      "original_link": "",
      "content": "- The FIFA Club World Cup is taking place in the United States this summer, featuring teams like Paris Saint-Germain and Auckland City FC.\n- The competition kicked off on June 14 with a 0-0 draw between Lionel Messi's Inter Miami and Al Ahly of Egypt.\n- The tournament features teams from different continents competing for a prize worth one billion dollars, with matches available for free on DAZN.\n- The standings and schedule of the tournament are provided for each group, with knockout stage matches scheduled for the end of June and beginning of July.\n- The final match of the FIFA Club World Cup is set to take place on July 13 at MetLife Stadium in East Rutherford, NJ.",
      "image": "",
      "category": "general"
    }
  ],
  "updates": [
    {
      "title": "",
      "date": "2025-06-19",
      "slug": "2025-gold-cup-scores-standings-table-schedule:-usmnt-mexico-canada-favorites-to-win-concacaf-competition",
      "source": "",
      "original_link": "",
      "content": "- The Gold Cup is currently underway in the United States, with 16 nations competing for North American supremacy until the final on July 6.\n- Mexico, the reigning champions, are the favorites to win, while Canada and the USMNT are strong contenders in the tournament.\n- Each team will play three group stage matches, with the top two teams from each group advancing to the quarterfinals.\n- The USMNT is in Group D, alongside Haiti, Saudi Arabia, and Trinidad and Tobago.\n- The key dates for the 2025 Concacaf Gold Cup include the quarterfinals on June 28-29, semifinals on July 2, and the final on July 6.",
      "image": "",
      "category": "general"
    },
    {
      "title": "A wedding during the MCWS?! More than one ring is on the line for Louisville's Tanner Shiver",
      "date": "2025-06-19",
      "slug": "a-wedding-during-the-mcws!-more-than-one-ring-is-on-the-line-for-louisville's-tanner-shiver",
      "source": "www.espn.com - TOP",
      "original_link": "https://www.espn.com/college-sports/story/_/id/45525962/2025-mens-college-world-series-louisville-tanner-shiver-wedding",
      "content": "- Tanner Shiver, a utility player for the Louisville Cardinals, is set to get married to Katelyn Farmer on Friday, but he is currently playing in the Men's College World Series.\n- Shiver plans to fly home for the wedding on Friday during an off day in the series, then fly back to Omaha for the championship round if Louisville advances.\n- Farmer, a former soccer player, is supportive of Shiver's commitment to both baseball and their wedding.\n- Shiver's journey to Division I baseball included starting as a walk-on and eventually transferring to Louisville for his graduate year.\n- Despite the hectic schedule, Shiver is determined to make it back in time for his wedding, showing his commitment to marrying the love of his life.",
      "image": "",
      "category": "general"
    },
    {
      "title": "Beard set to be named Burnley women manager",
      "date": "2025-06-19",
      "slug": "beard-set-to-be-named-burnley-women-manager",
      "source": "BBC Sport",
      "original_link": "https://www.bbc.com/sport/football/articles/c4gd0jg0eyeo",
      "content": "- Former Liverpool manager Matt Beard will be named head coach of Burnley women in the third tier.\n- Beard led Liverpool to back-to-back Women's Super League titles in 2013 and 2014.\n- Burnley will go fully professional next season under Beard's leadership.\n- Beard has had successful coaching stints at Chelsea, Liverpool, Boston Breakers, West Ham, and Bristol City.\n- Burnley has been without a permanent head coach since Rebecca Sawiuk left in March.",
      "image": "",
      "category": "general"
    }
  ]
}
