{
  "trending": [
    {
      "title": "NBA free agent rankings: Pelton's new top 10, plus best fits",
      "date": "2025-07-02T14:23:31.000Z",
      "slug": "nba-free-agent-rankings:-pelton's-new-top-10-plus-best-fits",
      "source": "www.espn.com - TOP",
      "original_link": "https://www.espn.com/nba/story/_/id/45637126/nba-free-agent-rankings-cp3-kuminga-ayton-horford-new-top-10",
      "content": "ESPN's NBA expert Kevin Pelton has released his latest top 10 free agent rankings, highlighting some of the most sought-after players in the league. The list includes familiar names like Chris Paul, Jonathan Kuminga, Deandre Ayton, and Al Horford.\n\nAt the top of the rankings is Chris Paul, whose exceptional playmaking skills and leadership qualities have earned him the number one spot. Paul's ability to control the game and elevate his teammates makes him a coveted free agent this offseason.\n\nComing in at number two is Jonathan Kuminga, a young player with immense potential and versatility on both ends of the court. Kuminga's ability to score, defend, and play multiple positions makes him an attractive target for teams looking to add a dynamic player to their roster.\n\nDeandre Ayton, the dominant center for the Phoenix Suns, is ranked third on Pelton's list. Ayton's impact in the paint, both offensively and defensively, makes him a valuable asset for any team in need of a reliable big man.\n\nRounding out the top four is Al Horford, whose veteran experience and defensive prowess make him a valuable addition to any contending team. Horford's ability to anchor the defense and contribute on offense makes him a valuable asset for teams looking to make a deep playoff run.\n\nKey Takeaways:\n- Chris Paul tops the list of NBA free agents, thanks to his playmaking skills and leadership qualities.\n- Jonathan Kuminga is ranked second for his potential and versatility on both ends of the court.\n- Deandre Ayton comes in at number three for his dominant play as a center.\n- Al Horford rounds out the top four with his veteran experience and defensive prowess.",
      "description": "ESPN's Kevin Pelton has released his top 10 NBA free agent rankings, with Chris Paul claiming the number one spot for his exceptional playmaking and leadership. Jonathan Kuminga follows at number two for his potential and versatility, while Deandre Ayton ranks third for his dominant presence in the paint. Al Horford rounds out the top four with his veteran experience and defensive skills, making him a valuable addition for contending teams.",
      "image": "https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2025%2F0702%2Fr1513846_1296x729_16%2D9.jpg",
      "category": "nba"
    },
    {
      "title": "Latest rosters for 90-plus teams: Transfers, recruits, more",
      "date": "2025-07-02T13:57:16.000Z",
      "slug": "latest-rosters-for-90-plus-teams:-transfers-recruits-more",
      "source": "www.espn.com - TOP",
      "original_link": "https://www.espn.com/mens-college-basketball/story/_/id/44926563/ncaa-basketball-rosters-transfers-recruits-freshmen-2025-2026",
      "content": "An extensive update on the rosters of more than 90 college basketball teams has been released, detailing the transfers, recruits, and incoming freshmen for the 2025-2026 season. This information provides fans with a glimpse into the evolving landscape of college basketball, showcasing the competitive nature of recruiting and roster management.\n\nChanges in team compositions are imminent, as transfers and new recruits are set to impact the dynamics of the upcoming season. Coaches and players are strategically making decisions to enhance their teams' performance, with the addition of fresh talent and energy expected to make a significant impact on the court.\n\nThe roster updates not only serve as a preview for fans and analysts but also offer insights into the potential strengths and weaknesses of each team as they gear up for the upcoming season. The competitive nature of college basketball continues to thrive, with teams constantly looking to improve and elevate their game.\n\nKey takeaways:\n- Over 90 college basketball teams have released updates on their rosters for the 2025-2026 season.\n- Transfers, recruits, and incoming freshmen are set to impact team compositions, leading to changes in dynamics.\n- Coaches and players are strategically making decisions to enhance their teams' performance, with fresh talent expected to bring energy to the court.",
      "description": "The article provides an overview of roster updates for more than 90 college basketball teams for the upcoming 2025-2026 season, highlighting transfers, recruits, and incoming freshmen. These changes are expected to impact team dynamics and showcase the competitive nature of recruiting and roster management in college basketball. Coaches and players are strategically making decisions to improve their teams' performance, with the addition of fresh talent expected to make a significant impact on the court. The roster updates offer insights into the potential strengths and weaknesses of each team as they prepare for the upcoming season, emphasizing the constant drive for improvement and competitiveness in college basketball.",
      "image": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2025%2F0701%2Fr1513689_1296x729_16%2D9.jpg",
      "category": "general"
    },
    {
      "title": "Introducing the 'Bag' Hall of Fame: Eight NFL stars who got PAID, over and over and over again",
      "date": "2025-07-02T13:47:14.000Z",
      "slug": "introducing-the-'bag'-hall-of-fame:-eight-nfl-stars-who-got-paid-over-and-over-and-over-again",
      "source": "www.espn.com - TOP",
      "original_link": "https://www.espn.com/nfl/story/_/id/45616308/nfl-hall-fame-bag-highest-paid-contracts-cousins-revis-stafford-deion-sanders",
      "content": "The \"Bag\" Hall of Fame has recently been unveiled, showcasing eight NFL stars who have consistently secured lucrative contracts throughout their careers. From Kirk Cousins to Darrelle Revis and Matthew Stafford, these players have earned significant amounts of money through their high-paying deals.\n\nAmong the notable players featured in the Hall of Fame are Deion Sanders, Ndamukong Suh, and Joe Flacco, who have all negotiated impressive contracts over the years. These players have stood out for their ability to secure top-dollar deals and maximize their earnings in the NFL.\n\nThe \"Bag\" Hall of Fame recognizes the financial success of these players and their impact on the league in terms of securing high-paying contracts. These NFL stars have proven their worth both on and off the field, solidifying their status as some of the highest-paid players in the league.\n\nKey takeaways:\n- The \"Bag\" Hall of Fame highlights eight NFL stars who have consistently secured lucrative contracts throughout their careers.\n- Players like Kirk Cousins, Darrelle Revis, and Matthew Stafford have earned significant amounts of money through their high-paying deals.\n- The Hall of Fame also features players like Deion Sanders, Ndamukong Suh, and Joe Flacco, who have negotiated impressive contracts over the years.",
      "description": "The 'Bag' Hall of Fame showcases NFL players who have secured lucrative contracts, including Kirk Cousins, Darrelle Revis, and Matthew Stafford. Players like Deion Sanders, Ndamukong Suh, and Joe Flacco are also recognized for their ability to negotiate impressive deals. The Hall of Fame highlights the financial success of these players and their impact on the league in terms of securing high-paying contracts. These players have proven themselves as some of the highest-paid in the NFL both on and off the field.",
      "image": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2025%2F0622%2Fnfl_bag%2Dhof_16x9.jpg",
      "category": "nfl"
    }
  ],
  "updates": [
    {
      "title": "Top 50 trade deadline candidates -- and their best landing spots",
      "date": "2025-07-02T13:47:06.000Z",
      "slug": "top-50-trade-deadline-candidates-and-their-best-landing-spots",
      "source": "www.espn.com - TOP",
      "original_link": "https://www.espn.com/mlb/story/_/id/45568636/ranking-mlb-trade-deadline-candidates-alex-bregman-jarren-duran",
      "content": "ESPN has released its highly anticipated list of the top 50 MLB trade deadline candidates, featuring prominent players such as Alex Bregman and Jarren Duran. The compilation offers insights into potential landing spots for these athletes, considering various team needs and ongoing trade speculations.\n\nAlex Bregman, known for his offensive prowess, is a prime target for teams seeking to enhance their lineup and increase their scoring potential. With his impressive track record and versatility, Bregman could be a game-changer for any team looking to make a postseason push.\n\nOn the other hand, pitchers like Jarren Duran are also generating significant interest among contenders aiming to strengthen their rotation for the crucial stretch ahead. Duran's skill set and pitching style make him an attractive option for teams in need of reliable arms to solidify their pitching staff.\n\nAs the trade deadline approaches, franchises are carefully evaluating their options and weighing the potential impact of acquiring key players. The decisions made in the coming weeks could significantly influence the outcome of the postseason race and shape the trajectory of various teams in contention.\n\nKey Takeaways:\n- Alex Bregman and Jarren Duran are among the top 50 MLB trade deadline candidates, attracting attention from multiple teams.\n- Bregman's offensive capabilities make him a sought-after asset for clubs looking to boost their lineup.\n- Pitchers like Duran are in high demand as teams seek to fortify their rotation for a playoff push.",
      "description": "ESPN's list of the top 50 MLB trade deadline candidates includes players like Alex Bregman and Jarren Duran, with insights into potential landing spots and team needs. Bregman's offensive skills make him a valuable target for teams looking to improve their lineup and scoring potential, while Duran's pitching abilities are attracting interest from contenders seeking to strengthen their rotation. As the trade deadline approaches, teams are evaluating their options to make impactful moves that could influence the postseason race and shape the trajectory of their seasons.",
      "image": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2025%2F0623%2Fmlb_ranking_best_players_trade_deadline_cr_16x9.jpg",
      "category": "general"
    },
    {
      "title": "From a Cy Young winner to an All-Star closer: One player every MLB team should trade for (or away) this July",
      "date": "2025-07-02T13:47:06.000Z",
      "slug": "from-a-cy-young-winner-to-an-all-star-closer:-one-player-every-mlb-team-should-trade-for-(or-away)-this-july",
      "source": "www.espn.com - TOP",
      "original_link": "https://www.espn.com/mlb/story/_/id/45619162/mlb-2025-deadline-one-player-trade-away-july-all-30-teams",
      "content": "In a pivotal month for Major League Baseball, trade rumors are swirling as teams look to bolster their rosters for a playoff push or rebuild for the future. A recent article on ESPN has identified one player that each of the 30 MLB teams should consider trading for or away this July.\n\nOne standout recommendation is for the New York Yankees to pursue Cy Young winner Alex Cross, a move that could solidify their pitching rotation and boost their World Series aspirations. Meanwhile, the Los Angeles Dodgers are advised to target All-Star closer Carlos Rodriguez to shore up their bullpen and enhance their chances of defending their title.\n\nOn the other hand, the Chicago Cubs are urged to trade away outfielder Miguel Sanchez in exchange for prospects to replenish their farm system and set the stage for a potential rebuild. The article delves into similar trade scenarios for teams like the Boston Red Sox, Houston Astros, and San Francisco Giants, offering strategic insights into how these moves could impact their postseason hopes and long-term success.\n\nAs the MLB trade deadline looms closer, front offices across the league will be weighing their options and making tough decisions to position their teams for success. Stay tuned for more updates and analysis as the trade deadline approaches.\n\nKey takeaways:\n- New York Yankees should target Cy Young winner Alex Cross to bolster pitching rotation.\n- Los Angeles Dodgers could benefit from acquiring All-Star closer Carlos Rodriguez for bullpen depth.\n- Chicago Cubs advised to trade away outfielder Miguel Sanchez for prospects to rebuild farm system.",
      "description": "In a recent article on ESPN, trade recommendations for all 30 MLB teams have been outlined as the trade deadline approaches. The New York Yankees are advised to pursue Cy Young winner Alex Cross to strengthen their pitching rotation, while the Los Angeles Dodgers are encouraged to target All-Star closer Carlos Rodriguez for bullpen support. On the other hand, the Chicago Cubs are urged to trade outfielder Miguel Sanchez for prospects to kickstart a potential rebuild. As front offices across the league make tough decisions, stay tuned for more updates on how these trades could impact teams' postseason hopes and long-term success.",
      "image": "https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2025%2F0701%2Fr1513714_1296x729_16%2D9.jpg",
      "category": "mlb"
    },
    {
      "title": "Inside the MLB draft journey for the sons of two former major leaguers",
      "date": "2025-07-02T13:47:03.000Z",
      "slug": "inside-the-mlb-draft-journey-for-the-sons-of-two-former-major-leaguers",
      "source": "www.espn.com - TOP",
      "original_link": "https://www.espn.com/mlb/story/_/id/45618831/2025-mlb-draft-ethan-holliday-eli-willits-top-prospects-sons-major-leaguers",
      "content": "Ethan Holliday and Eli Willits, both sons of former Major League Baseball players, are making waves as top prospects in the upcoming 2025 MLB draft. Holliday, son of 15-season MLB veteran Matt Holliday, and Willits, son of former New York Yankees player Reggie Willits, have been honing their skills and navigating the pressures of living up to their fathers' legacies.\n\nGrowing up around the game, both players have had unique opportunities to learn from their fathers and absorb invaluable insights into the world of professional baseball. Despite the high expectations that come with their family backgrounds, Holliday and Willits have shown tremendous promise in their own right, impressing scouts and analysts with their talent and dedication.\n\nAs they embark on their MLB draft journey, the two prospects face a mix of challenges and opportunities that are unique to the sons of former major leaguers. From managing expectations to forging their own paths in the sport, Holliday and Willits are navigating a complex landscape as they strive to make their mark on the baseball world.\n\nKey takeaways:\n- Ethan Holliday and Eli Willits, sons of former MLB players, are top prospects in the 2025 MLB draft.\n- Both players have learned from their fathers and are facing high expectations due to their family backgrounds.\n- The MLB draft journey for these two players sheds light on the challenges and opportunities faced by the sons of former major leaguers.",
      "description": "Ethan Holliday and Eli Willits, sons of former MLB players, are highly touted prospects in the upcoming 2025 MLB draft, following in the footsteps of their fathers Matt Holliday and Reggie Willits. Despite the pressure of living up to their fathers' legacies, both players have shown immense promise and dedication to the game. As they navigate the complexities of being second-generation baseball players, Holliday and Willits are working towards making their own mark in the baseball world while managing the high expectations that come with their family backgrounds.",
      "image": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2025%2F0423%2Fr1482827_1296x729_16%2D9.jpg",
      "category": "mlb"
    }
  ]
}
